/*
*********************************************************************************************************
* @file    	utils.c
* @author  	SY
* @version 	V1.0.0
* @date    	2016-10-11 15:10:28
* @IDE	 	Keil V5.18.0.0
* @Chip    	STM32F407VE
* @brief   	工具包源文件
*********************************************************************************************************
* @attention
*
* 
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                              				Private Includes
*********************************************************************************************************
*/
#include "utils.h"

/*
*********************************************************************************************************
*                              				Private define
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                              				Private typedef
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                              				Private constants
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                              				Private macro
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                              				Private variables
*********************************************************************************************************
*/
uint8_t g_PicBuff[PIC_BUFF_SIZE];

/*
*********************************************************************************************************
*                              				Private function prototypes
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                              				Private functions
*********************************************************************************************************
*/
/*
*********************************************************************************************************
* Function Name : htons
* Description	: 16位数据大小端切换
* Input			: None
* Output		: None
* Return		: None
*********************************************************************************************************
*/
uint16_t hton16(uint16_t n)
{
  return ((n & 0xff) << 8) | ((n & 0xff00) >> 8);
}

/*
*********************************************************************************************************
* Function Name : htonl
* Description	: 32位数据大小端切换
* Input			: None
* Output		: None
* Return		: None
*********************************************************************************************************
*/
uint32_t hton32(uint32_t n)
{
  return ((n & 0xff) << 24) |
    ((n & 0xff00) << 8) |
    ((n & 0xff0000UL) >> 8) |
    ((n & 0xff000000UL) >> 24);
}

/*
*********************************************************************************************************
* Function Name : float2char
* Description	: 浮点数转换为字符串
* Input			: None
* Output		: None
* Return		: None
*********************************************************************************************************
*/
void float2char( uint8_t sumBit, uint8_t pointBit, float source, char * const str )
{
	char strBuff[MAX_STRING_NUM+1] = {0};
	
	if (sumBit > MAX_STRING_NUM)
	{
		sumBit = MAX_STRING_NUM;
	}
	
	if ((source>999999.5f) || (source<-99999.5f))
	{
		strcpy(str,"------");
		
		return;
	}	
	
	/* snprintf()内部已经进行四舍五入修约，但是有些情况下需要进行以下处理，结果才准确。
		最多支持小数点后三位。
	*/
	if (source < 0)
	{
		source -= 0.00001f;
	}
	else
	{
		source += 0.00001f;
	}
	
	{
		char formateBuff[10] = {0};	
		uint8_t bit = 0;
		
		formateBuff[bit++] = '%';
		formateBuff[bit++] = '.';
		formateBuff[bit++] = '0' + pointBit;
		formateBuff[bit++] = 'f';
		
		snprintf(strBuff,sumBit+1,formateBuff,source);
	}
	
	strcpy(str,strBuff);
}

/*
*********************************************************************************************************
* Function Name : num2char
* Description	: 数字转换为字符串
* Input			: None
* Output		: None
* Return		: None
*********************************************************************************************************
*/
void num2char( uint8_t sumBit, int32_t source, char * const str )
{
	char strBuff[MAX_STRING_NUM+1] = {0};
	
	if (sumBit > MAX_STRING_NUM)
	{
		sumBit = MAX_STRING_NUM;
	}
	
	{
		char formateBuff[10] = {0};	
		uint8_t bit = 0;
		
		formateBuff[bit++] = '%';
		formateBuff[bit++] = 'd';
		
		snprintf(strBuff,sumBit+1,formateBuff,source);
	}
	
	strcpy(str,strBuff);
}

/*
*********************************************************************************************************
* Function Name : RemoveStrChar
* Description	: 移除字符串中指定的字符
* Input			: None
* Output		: None
* Return		: 被移除的字符个数
*********************************************************************************************************
*/
uint8_t RemoveStrChar( char *str, const char c )
{
	uint8_t i = 0,pos = 0;
	uint8_t len = strlen(str);
	
	while ( str[i++] == c)
	{
		pos++;
	}
	
	if ( pos )
	{
		memmove(str,&str[pos],len+1-pos);
	}
	
	return pos;
}

/*
*********************************************************************************************************
* Function Name : FloatIsEqual
* Description	: 浮点数是否相等
* Input			: None
* Output		: None
* Return		: None
*********************************************************************************************************
*/
bool FloatIsEqual(float fp1, float fp2)
{
	if( abs( fp1 - fp2 ) < EPSINON ) 
	{
		return true;
	}
	else
	{
		return false;
	}
}

/*
*********************************************************************************************************
* Function Name : GetTwoMonthDays
* Description	: 获取2月的天数
* Input			: None
* Output		: None
* Return		: None
*********************************************************************************************************
*/
static uint8_t GetTwoMonthDays(uint16_t year)
{
	uint8_t day;
	
	if(((year%4==0) && (year%100!=0)) || (year%400==0))//判断是不是闰年
	{
		day = 29;
	}
	else
	{
		day = 28;
	}
  
	return day;
}

/*
*********************************************************************************************************
* Function Name : GetMonthDays
* Description	: 获取某月的天数
* Input			: None
* Output		: None
* Return		: None
*********************************************************************************************************
*/
uint8_t GetMonthDays( uint16_t year, uint8_t mouth )
{
	uint8_t day = 0;

	switch (mouth)
	{
		case 1:
		case 3:
		case 5:
		case 7:
		case 8:
		case 10:
		case 12:
			day = 31;
			break;
		case 4:
		case 6:
		case 9:
		case 11:
			day = 30;
			break;
		case 2:
			day = GetTwoMonthDays(year);	//获取某一年的2月份的天数
			break;		
	}

	return day;
}

/*
*********************************************************************************************************
* Function Name : BuffCmpWithChar
* Description	: 比较字符缓冲区每个元素是否和目标值相等
* Input			: None
* Output		: None
* Return		: None
*********************************************************************************************************
*/
TestStatus BuffCmpWithChar( const uint8_t *pSorce, uint8_t target, uint32_t lenth )
{
	uint32_t i;
	
	for (i=0; i<lenth; ++i)
	{
		if (pSorce[i] != target)
		{
			return FAILED;
		}
	}
	
	return PASSED;
}

/*
*********************************************************************************************************
* Function Name : ExchangeData
* Description	: 交换数据
* Input			: None
* Output		: None
* Return		: None
*********************************************************************************************************
*/
void ExchangeData( void *data1, void *data2, void (*exchangeData_CallBack)( void *data1, void *data2 ) )
{
	if (exchangeData_CallBack)
	{
		exchangeData_CallBack(data1,data2);
	}
}

/************************ (C) COPYRIGHT STMicroelectronics **********END OF FILE*************************/

